#!/bin/bash
 
# 添加所有变更到暂存区
git add . & pid=$!
wait $pid
echo "<====================添加变更到暂存区成功====================>"
echo "<====================开始提交变更====================>"
# 提交变更
git commit -m "$1" & pid=$!
wait $pid
echo "<====================commit成功====================>"
echo "<====================开始推送到远程仓库====================>"
if git pull --rebase; then
# 推送到远程仓库
git push origin "$2" & pid=$!
wait $pid
echo "<====================推送到远程仓库成功====================>"
else 
echo "!====================推送到远程仓库失败，可能存在冲突或网络问题====================!"
exit 1
fi
