#!/bin/bash
 
git add . & pid=$!
wait $pid
echo "<====================添加变更到暂存区成功====================>"
echo "<====================开始提交变更====================>"
git commit -m "$1" & pid=$!
wait $pid
echo "<====================提交变更成功====================>"
echo "<====================开始拉取远程分支并合并变更====================>"
if git pull --rebase; then
echo "<====================拉取远程分支并合并变更成功====================>"
echo "<====================开始推送到远程仓库====================>"
git push origin "$2" & pid=$!
wait $pid
echo "<====================推送到远程仓库成功====================>"
else 
echo "!====================推送到远程仓库失败，可能存在冲突或网络问题====================!"
exit 1
fi
